## Pandas

A library which is used for data manupulation and analysis. It is actually built on top of numpy array

In [1]:
import numpy as np
import pandas as pd

### Pandas Series

It is very similar to numpy array and actually it is built on top of numpy array.  One addition here, with series we can index an array with the label and use those labels as index instead of number location to access data in an array. Each item in an series can be any valid python objects.

#### Create a Series using Lists

In [26]:
list = [1,2,3,4,5]
labels = ['a','b','c','d','e']

print("Without providing index labels", pd.Series(data=list),"Index gets Auto Generated")
print("Providing index labels", pd.Series(data=list,index =labels),"Index gets assigned from labels")

Without providing index labels 0    1
1    2
2    3
3    4
4    5
dtype: int64 Index gets Auto Generated
Providing index labels a    1
b    2
c    3
d    4
e    5
dtype: int64 Index gets assigned from labels

#### Create a Series using Numpy Arrays

In [9]:
arr = np.array([1,2,3,4,5])
labels = ['a','b','c','d','e']

print("Without providing index labels", pd.Series(data=arr),"Index gets Auto Generated")
print("Providing index labels", pd.Series(data=arr,index =labels),"Index gets assigned from labels")

Without providing index labels 0    1
1    2
2    3
3    4
4    5
dtype: int32 Index gets Auto Generated
Providing index labels a    1
b    2
c    3
d    4
e    5
dtype: int32 Index gets assigned from labels

#### Create a Series using Dictionaries

In [13]:
dict = {'a':1,'b':2,'c':3, 'd' : 4, 'e' : 5}
print("Assign both data and labels", pd.Series(data=dict),"Labels gets assigned from dict keys")

Assign both data and labels a    1
b    2
c    3
d    4
e    5
dtype: int64 Labels gets assigned from dict keys

#### Index Lookups

In [22]:
series = pd.Series([1,2,3,4,5], ['a','b','c','d','e'])
print("Access by Index", series['c'],type(series['c']))

series2 = pd.Series([1,2,3,4,5,6], ['a','b','c','d','e','f'])
print("Operarion by Index. Example concat 2 series based on index", series + series2)

Access by Index 3 <class 'numpy.int64'>
Operarion by Index. Example concat 2 series based on index a     2.0
b     4.0
c     6.0
d     8.0
e    10.0
f     NaN
dtype: float64

#### Hold different object types

In [25]:
pd.Series([1,'a',"hello",print])

0                            1
1                            a
2                        hello
3    <built-in function print>
dtype: object

## DataFrames

Dataframe is nothing but the collection of series. Each column in dataframe is a series which share the same index

In [2]:
arr = np.arange(20).reshape(5,4)

df = pd.DataFrame(data = arr)

print("Auto Row/Column label Index")
print(df)


print("Assign Row Index")
df = pd.DataFrame(data = arr, index = ['r1','r2','r3','r4','r5'])
print(df)

print("Assign Row and Column Index")
df = pd.DataFrame(data = arr, index = ['r1','r2','r3','r4','r5'], columns = ['c1','c2','c3','c4'] )
print(df)

Auto Row/Column label Index
    0   1   2   3
0   0   1   2   3
1   4   5   6   7
2   8   9  10  11
3  12  13  14  15
4  16  17  18  19
Assign Row Index
     0   1   2   3
r1   0   1   2   3
r2   4   5   6   7
r3   8   9  10  11
r4  12  13  14  15
r5  16  17  18  19
Assign Row and Column Index
    c1  c2  c3  c4
r1   0   1   2   3
r2   4   5   6   7
r3   8   9  10  11
r4  12  13  14  15
r5  16  17  18  19

#### Select Columns

In [62]:
print('Select by column label')
print(df['c2'])
print('Select by multiple column labels')
print(df[['c2','c4']])

print('Each column in dataframe is nothing but a series', type(df['c3']))

Select by column label
r1     1
r2     5
r3     9
r4    13
r5    17
Name: c2, dtype: int32
Select by multiple column labels
    c2  c4
r1   1   3
r2   5   7
r3   9  11
r4  13  15
r5  17  19
Each column in dataframe is nothing but a series <class 'pandas.core.series.Series'>

#### Creating columns in a dataframe

In [3]:
df['colNew'] = df['c4']  - df['c2']
print("create new computed column")
print(df)

df['colNew'] = [4,4,4,4,4]
print("assign the python list to new column")
print(df)

create new computed column
    c1  c2  c3  c4  colNew
r1   0   1   2   3       2
r2   4   5   6   7       2
r3   8   9  10  11       2
r4  12  13  14  15       2
r5  16  17  18  19       2
assign the python list to new column
    c1  c2  c3  c4  colNew
r1   0   1   2   3       4
r2   4   5   6   7       4
r3   8   9  10  11       4
r4  12  13  14  15       4
r5  16  17  18  19       4

#### Removing Columns And Rows

In [4]:
dfcol = df.copy()
print("Removing column need axis = 1 since by default axis takes 0")
print(dfcol.drop('colNew', axis = 1))
print(dfcol)
print("Removing column in place")
print(dfcol.drop('colNew', axis = 1,inplace = True))
print(dfcol)

print("Removing row in place")
print(dfcol.drop('r1', axis = 0,inplace = True))
print(dfcol)

Removing column need axis = 1 since by default axis takes 0
    c1  c2  c3  c4
r1   0   1   2   3
r2   4   5   6   7
r3   8   9  10  11
r4  12  13  14  15
r5  16  17  18  19
    c1  c2  c3  c4  colNew
r1   0   1   2   3       4
r2   4   5   6   7       4
r3   8   9  10  11       4
r4  12  13  14  15       4
r5  16  17  18  19       4
Removing column in place
None
    c1  c2  c3  c4
r1   0   1   2   3
r2   4   5   6   7
r3   8   9  10  11
r4  12  13  14  15
r5  16  17  18  19
Removing row in place
None
    c1  c2  c3  c4
r2   4   5   6   7
r3   8   9  10  11
r4  12  13  14  15
r5  16  17  18  19

#### Select Rows and its subset

To select the row by label named index use 'loc', to select by number index use 'iloc'

In [65]:
print("Select by named index")
print(df.loc['r2'])
print("Select by location index")
df.iloc[1]

Select by named index
c1        4
c2        5
c3        6
c4        7
colNew    4
Name: r2, dtype: int64
Select by location index

c1        4
c2        5
c3        6
c4        7
colNew    4
Name: r2, dtype: int64

In [66]:
print("Select Subsets of rows by named index")
print(df.loc[['r1','r3']])

print("Select Subsets of rows by location index")
print(df.iloc[[0,2]])

print("Select Subsets of rows and columns by named index")
print(df.loc[['r1','r3'],['c3','c4']])

print("Select Subsets of rows and columns by location index")
print(df.iloc[[0,2],[2,3]])

Select Subsets of rows by named index
    c1  c2  c3  c4  colNew
r1   0   1   2   3       4
r3   8   9  10  11       4
Select Subsets of rows by location index
    c1  c2  c3  c4  colNew
r1   0   1   2   3       4
r3   8   9  10  11       4
Select Subsets of rows and columns by named index
    c3  c4
r1   2   3
r3  10  11
Select Subsets of rows and columns by location index
    c3  c4
r1   2   3
r3  10  11

In [67]:
print("Select Subsets of rows by conditions")
print(df[df['c1']>5])

print("Select Subsets of rows by more than one condition")
print(df[(df['c1']>5) & (df['c2']<17)])

print("Select Subsets of rows and columns by more than one condition")
print(df[(df['c1']>5) & (df['c2']<17)][['c1','c2']])

Select Subsets of rows by conditions
    c1  c2  c3  c4  colNew
r3   8   9  10  11       4
r4  12  13  14  15       4
r5  16  17  18  19       4
Select Subsets of rows by more than one condition
    c1  c2  c3  c4  colNew
r3   8   9  10  11       4
r4  12  13  14  15       4
Select Subsets of rows and columns by more than one condition
    c1  c2
r3   8   9
r4  12  13

#### Set/Reset Indexes

In [72]:
print(df)

print("Reset index creates a new column for exising named index and it replaces location number as indexes ")
df.reset_index(inplace=True)
print(df)

print("To set column as row index")
df.set_index('index',inplace=True)
print(df)

       c1  c2  c3  c4  colNew
index
r1      0   1   2   3       4
r2      4   5   6   7       4
r3      8   9  10  11       4
r4     12  13  14  15       4
r5     16  17  18  19       4
Reset index creates a new column for exising named index and it replaces location number as indexes
  index  c1  c2  c3  c4  colNew
0    r1   0   1   2   3       4
1    r2   4   5   6   7       4
2    r3   8   9  10  11       4
3    r4  12  13  14  15       4
4    r5  16  17  18  19       4
To set column as row index
       c1  c2  c3  c4  colNew
index
r1      0   1   2   3       4
r2      4   5   6   7       4
r3      8   9  10  11       4
r4     12  13  14  15       4
r5     16  17  18  19       4

#### Other DataFrame Functions

In [81]:
print("Get various aggregated results for each column")
print(df.describe())
print("Information about a DataFrame including the index dtype and column dtypes, non-null values and memory usage.")
print(df.info())
print("Datatypes of each columns")
print(df.dtypes)

Get various aggregated results for each column
              c1         c2         c3         c4  colNew
count   5.000000   5.000000   5.000000   5.000000     5.0
mean    8.000000   9.000000  10.000000  11.000000     4.0
std     6.324555   6.324555   6.324555   6.324555     0.0
min     0.000000   1.000000   2.000000   3.000000     4.0
25%     4.000000   5.000000   6.000000   7.000000     4.0
50%     8.000000   9.000000  10.000000  11.000000     4.0
75%    12.000000  13.000000  14.000000  15.000000     4.0
max    16.000000  17.000000  18.000000  19.000000     4.0
Information about a DataFrame including the index dtype and column dtypes, non-null values and memory usage.
<class 'pandas.core.frame.DataFrame'>
Index: 5 entries, r1 to r5
Data columns (total 5 columns):
 #   Column  Non-Null Count  Dtype
---  ------  --------------  -----
 0   c1      5 non-null      int32
 1   c2      5 non-null      int32
 2   c3      5 non-null      int32
 3   c4      5 non-null      int32
 4   colNew  5 non-null      int64
dtypes: int32(4), int64(1)
memory usage: 320.0+ bytes
None
Datatypes of each columns
c1        int32
c2        int32
c3        int32
c4        int32
colNew    int64
dtype: object

In [84]:
print("Condition based Value counts")

conditions = df['c1']>5
print(conditions.value_counts())

Condition based Value counts
True     3
False    2
Name: c1, dtype: int64

In [89]:
print('by default it returns first 5 rows')
df.head()

by default it returns first 5 rows

       c1  c2  c3  c4  colNew
index
r1      0   1   2   3       4
r2      4   5   6   7       4
r3      8   9  10  11       4
r4     12  13  14  15       4
r5     16  17  18  19       4

In [90]:
df.head(2)

       c1  c2  c3  c4  colNew
index
r1      0   1   2   3       4
r2      4   5   6   7       4

In [5]:
df.tail()

    c1  c2  c3  c4  colNew
r1   0   1   2   3       4
r2   4   5   6   7       4
r3   8   9  10  11       4
r4  12  13  14  15       4
r5  16  17  18  19       4

#### Handle missing data

In [33]:
dict = {'a':[1, np.nan , np.nan],'b':[2, 4, np.nan],'c': [3,5,np.nan], 'd' : [4,8,7], 'e' : [8,3,6]}
df = pd.DataFrame(dict)
df

     a    b    c  d  e
0  1.0  2.0  3.0  4  8
1  NaN  4.0  5.0  8  3
2  NaN  NaN  NaN  7  6

###### By default returns the rows where no columns is missing

In [34]:
df.dropna()

     a    b    c  d  e
0  1.0  2.0  3.0  4  8

###### Provide axis =1 to return the colums with no missing data

In [39]:
df.dropna(axis =1)

   d  e
0  4  8
1  8  3
2  7  6

###### Keep only the rows with at least 2 non-NA values.

In [40]:
df.dropna(thresh=3)

     a    b    c  d  e
0  1.0  2.0  3.0  4  8
1  NaN  4.0  5.0  8  3

###### Define in which columns to look for missing values.

In [42]:
df.dropna(subset=['b','c'])

     a    b    c  d  e
0  1.0  2.0  3.0  4  8
1  NaN  4.0  5.0  8  3

###### Fill missing values

In [43]:
df.fillna(0)

     a    b    c  d  e
0  1.0  2.0  3.0  4  8
1  0.0  4.0  5.0  8  3
2  0.0  0.0  0.0  7  6

###### propagate non-null values forward or backward

In [44]:
df.fillna(method='ffill')

     a    b    c  d  e
0  1.0  2.0  3.0  4  8
1  1.0  4.0  5.0  8  3
2  1.0  4.0  5.0  7  6

###### fill mean values

In [46]:
df['b'].fillna(df['b'].mean())

0    2.0
1    4.0
2    3.0
Name: b, dtype: float64

###### to apply it to all columns. let's use lambda apply function

In [54]:
df.apply(lambda f: f.fillna(f.mean()), axis = 0)

     a    b    c  d  e
0  1.0  2.0  3.0  4  8
1  1.0  4.0  5.0  8  3
2  1.0  3.0  4.0  7  6

#### Group by

A groupby operation involves some combination of splitting the object, applying a function, and combining the results. This can be used to group large amounts of data and compute operations on these groups.

In [129]:
dict = {'Skills':['JAVA','C#','JAVASCRIPT','PYTORCH','JAVASCRIPT','PYTORCH'],
       'Name':['Barath','Steve','John','Ani','Achelles','Sam'],
       'Salary':[100,100,120,130,110,120]}
df = pd.DataFrame(dict)
df

       Skills      Name  Salary
0        JAVA    Barath     100
1          C#     Steve     100
2  JAVASCRIPT      John     120
3     PYTORCH       Ani     130
4  JAVASCRIPT  Achelles     110
5     PYTORCH       Sam     120

In [130]:
df_bySkill = df.groupby('Skills')

###### Average Salary based on skills

In [61]:
df_bySkill.mean()

            Salary
Skills
C#             100
JAVA           100
JAVASCRIPT     115
PYTORCH        125

###### Highest salary by Skill

In [65]:
df_bySkill.max()

              Name  Salary
Skills
C#           Steve     100
JAVA        Barath     100
JAVASCRIPT    John     120
PYTORCH        Sam     130

###### No of people per skill

In [66]:
df_bySkill.count()

            Name  Salary
Skills
C#             1       1
JAVA           1       1
JAVASCRIPT     2       2
PYTORCH        2       2

In [71]:
df_bySkill.describe()

           Salary
            count   mean       std    min    25%    50%    75%    max
Skills
C#            1.0  100.0       NaN  100.0  100.0  100.0  100.0  100.0
JAVA          1.0  100.0       NaN  100.0  100.0  100.0  100.0  100.0
JAVASCRIPT    2.0  115.0  7.071068  110.0  112.5  115.0  117.5  120.0
PYTORCH       2.0  125.0  7.071068  120.0  122.5  125.0  127.5  130.0

#### Pandas Operations

###### Get the counts per skill 

which is same as df_bySkill.count() above.

In [72]:
df['Skills'].value_counts()

PYTORCH       2
JAVASCRIPT    2
JAVA          1
C#            1
Name: Skills, dtype: int64

###### Get the unique skills

In [75]:
df['Skills'].unique()

array(['JAVA', 'C#', 'JAVASCRIPT', 'PYTORCH'], dtype=object)

###### Get the number of unique skills

In [78]:
df['Skills'].nunique()

4

###### Sort by skills

In [77]:
df.sort_values(by='Skills')

       Skills      Name  Salary
1          C#     Steve     100
0        JAVA    Barath     100
2  JAVASCRIPT      John     120
4  JAVASCRIPT  Achelles     110
3     PYTORCH       Ani     130
5     PYTORCH       Sam     120

###### There are 2 ways to remove the column from dataframe

1) we saw that using drop function with inplace True
2) Using del keyword

In [79]:
del df["Name"]
df

       Skills  Salary
0        JAVA     100
1          C#     100
2  JAVASCRIPT     120
3     PYTORCH     130
4  JAVASCRIPT     110
5     PYTORCH     120

###### Apply and lambda is a important function to run a function element wise

In [80]:
df["Salary"].apply(lambda x: x*2)

0    200
1    200
2    240
3    260
4    220
5    240
Name: Salary, dtype: int64

In [131]:
def multiplyby2(x):
    return x*2

df["Salary"].apply(multiplyby2)

0    200
1    200
2    240
3    260
4    220
5    240
Name: Salary, dtype: int64

In [132]:
df["Skills"].map({'JAVA':1, 'C#':2,'JAVASCRIPT':3, 'PYTORCH':4 })

0    1
1    2
2    3
3    4
4    3
5    4
Name: Skills, dtype: int64

In [87]:
print(df.columns)
print(df.index)

Index(['Skills', 'Salary'], dtype='object')
RangeIndex(start=0, stop=6, step=1)

In [88]:
pwd

'C:\\Barath\\Github\\NLP Learning And Training\\NLP-Learning-And-Training\\Installation and Basics'

In [89]:
df = pd.read_csv('headbrain.csv')

In [92]:
df.head()

   Gender  Age Range  Head Size(cm^3)  Brain Weight(grams)
0       1          1             4512                 1530
1       1          1             3738                 1297
2       1          1             4261                 1335
3       1          1             3777                 1282
4       1          1             4177                 1590

###### Convert to other CSV file

Here we simply normalizing the input data and added new columns and saving to other csv

In [96]:
updatedf = df.copy()
updatedf = (updatedf - updatedf.mean())/updatedf.std()
updatedf.insert(0, "c2", 1)

In [98]:
updatedf.to_csv("new.csv")

In [103]:
df = pd.read_csv("new.csv")
df

     Unnamed: 0  c2    Gender  Age Range  Head Size(cm^3)  Brain Weight(grams)
0             0   1 -0.874879  -1.072228         2.403781             2.053562
1             1   1 -0.874879  -1.072228         0.284751             0.117388
2             2   1 -0.874879  -1.072228         1.716602             0.433159
3             3   1 -0.874879  -1.072228         0.391524            -0.007258
4             4   1 -0.874879  -1.072228         1.486630             2.552148
..          ...  ..       ...        ...              ...                  ...
232         232   1  1.138192   0.928702        -1.149838            -1.436536
233         233   1  1.138192   0.928702        -0.657041            -0.564012
234         234   1  1.138192   0.928702        -1.097821            -1.486395
235         235   1  1.138192   0.928702        -0.772027            -0.937951
236         236   1  1.138192   0.928702        -0.665254            -1.353439

[237 rows x 6 columns]

###### Read Excel file

to read the excel file install 

    conda install xlrd
    conda install openpyxl

and restart the notebook

In [106]:
df = pd.read_excel('TEST.xlsx')
df.head()

   Gender  Age Range  Head Size(cm^3)  Brain Weight(grams)
0       1          1             4512                 1530
1       1          1             3738                 1297
2       1          1             4261                 1335
3       1          1             3777                 1282
4       1          1             4177                 1590

###### save dataframe as excel file

In [109]:
df.to_excel('TEST SAMPLE.xlsx',sheet_name='Sheet1')

In [115]:
df = pd.read_excel('TEST SAMPLE.xlsx')
df.drop('Unnamed: 0', axis = 1, inplace = True)
df.head()

   Gender  Age Range  Head Size(cm^3)  Brain Weight(grams)
0       1          1             4512                 1530
1       1          1             3738                 1297
2       1          1             4261                 1335
3       1          1             3777                 1282
4       1          1             4177                 1590

##### Read the html files
install below 

    conda install lxml
    conda install html5lib
    conda install beautifulsoup4
    
 Read list of html tables from web pages

In [120]:
df = pd.read_html('https://en.wikipedia.org/wiki/List_of_S%26P_500_companies')

In [124]:
df[0].head()

,Symbol,Security,SEC filings,GICS Sector,GICS Sub Industry,Headquarters Location,Date first added,CIK,Founded
0,MMM,3M Company,reports,Industrials,Industrial Conglomerates,"St. Paul, Minnesota",1976-08-09,66740,1902
1,ABT,Abbott Laboratories,reports,Health Care,Health Care Equipment,"North Chicago, Illinois",1964-03-31,1800,1888
2,ABBV,AbbVie Inc.,reports,Health Care,Pharmaceuticals,"North Chicago, Illinois",2012-12-31,1551152,2013 (1888)
3,ABMD,ABIOMED Inc,reports,Health Care,Health Care Equipment,"Danvers, Massachusetts",2018-05-31,815094,1981
4,ACN,Accenture plc,reports,Information Technology,IT Consulting & Other Services,"Dublin, Ireland",2011-07-06,1467373,1989

In [127]:
df[1].head()

            Date  Added                               Removed  \
            Date Ticker                      Security  Ticker
0   May 22, 2020    WST  West Pharmaceutical Services      HP
1   May 12, 2020    DPZ                Domino's Pizza    CPRI
2   May 12, 2020   DXCM                        Dexcom     AGN
3  April 6, 2020    NaN                           NaN       M
4  April 6, 2020    NaN                           NaN     RTN

                                                                 Reason
            Security                                             Reason
0  Helmerich & Payne                   Market capitalization change.[6]
1     Capri Holdings                   Market capitalization change.[7]
2           Allergan                    Allergan acquired by AbbVie.[7]
3       Macy's, Inc.                   Market capitalization change.[8]
4   Raytheon Company  United Technologies spun off Otis and Carrier ...